ХамелионЦРПТ/src/DataProcessors/СоздатьВводВОборотКоробами_ХамелеонЦРПТ/СоздатьВводВОборотКоробами_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СоздатьВводВОборотКоробами_ХамелеонЦРПТ</name>
</mdclass:DataProcessor>

ХамелионЦРПТ/src/Enums/СтатусыДокументов_ХамелеонЦРПТ/СтатусыДокументов_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументов_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтвета</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>ФайлОбработанЧастично</name>
  </enumValues>
  <enumValues>
    <name>ОтправленЧерновик</name>
  </enumValues>
  <enumValues>
    <name>ЧерновикОбработан</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннийПромежуточныйСтатус</name>
  </enumValues>
  <enumValues>
    <name>ПринятИПереданВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>КМЧастичноЭмитированы</name>
  </enumValues>
  <enumValues>
    <name>КМЭмитирован</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтветаОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессе</name>
  </enumValues>
  <enumValues>
    <name>ОжидаемРегистрациюУчастникавИСМП</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноПринят</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВЭДО</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/ВидДокументаУпаковок_ХамелеонЦРПТ/ВидДокументаУпаковок_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДокументаУпаковок_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Формирование</name>
  </enumValues>
  <enumValues>
    <name>Расформирование</name>
  </enumValues>
  <enumValues>
    <name>ИзъятиеИзУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ДобавлениеВУпаковку</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Documents/СозданиеНовогоШкНаКороба_ХамелеонЦРПТ/СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СозданиеНовогоШкНаКороба_ХамелеонЦРПТ</name>
  <basedOn>Document.ВводВОборот_ХамелеонЦРПТ</basedOn>
  <basedOn>Document.ЗаказМарок_ХамелеонЦРПТ</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКМЭмитированые_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВКоробе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>_Order_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОтправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКороба</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ВидДокументаУпаковок_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКМ</name>
    <type>
      <types>EnumRef.СтатусыКМДляАгрегации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧерезСУЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдПроизводственногоЗаказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУпаковки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>GTINУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказДляФормированияНомераКОроба</name>
    <type>
      <types>DocumentRef.ЗаказМарок_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводВоборот</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>РасформированиеКоробов</name>
    <type>
      <types>DocumentRef.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПалет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЛекарства</name>
    <type>
      <types>CatalogRef.Договора_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходитВГрупповую</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтарыйКороб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИзЗаказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерБокса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>cis</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзъятьИзУпаковки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАгрегации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипУпаковки</name>
      <type>
        <types>EnumRef.Тип_КМ_ХамелеонЦРПТ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БылоДоЭтого</name>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерБокса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылканаДокумент</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МаркиОприходовать</name>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКороба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НомераБлоков</name>
    <attributes>
      <name>НомерБлока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Агрегации</name>
    <attributes>
      <name>Агрегация</name>
      <type>
        <types>DocumentRef.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ХамелионЦРПТ/src/DataProcessors/СоздатьВводВОборотКоробами_ХамелеонЦРПТ/Forms/Форма/Module.bsl
&НаСервере
Процедура Команда1НаСервере()
	// Вставить содержимое обработчика.
	
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВводВОборот_ХамелеонЦРПТСерийныеНомера.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВводВОборот_ХамелеонЦРПТ КАК ВводВОборот_ХамелеонЦРПТСерийныеНомера
		|ГДЕ
		|	ВводВОборот_ХамелеонЦРПТСерийныеНомера.Проведен
		|	И ВводВОборот_ХамелеонЦРПТСерийныеНомера.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Отправлен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	ДокумВВобВоборот=Документы.ВводВОборот_ХамелеонЦРПТ.СоздатьДокумент();
	ТаблицаЗн=Новый ТаблицаЗначений;
	ТаблицаЗн.Колонки.Добавить("ВводВОборот");
	ТаблицаЗн.Колонки.Добавить("НомерДекларацииТовара");
	ТаблицаЗн.Колонки.Добавить("ДатаДекларацииТовара");
	ТаблицаЗн.Колонки.Добавить("ТипДокумента");
	ТаблицаЗн.Колонки.Добавить("ДатаПроизводства");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		
	//	Сообщить(ВыборкаДетальныеЗаписи.Ссылка);
	//	Продолжить;
		
		Для Каждого Стр_1 Из   ВыборкаДетальныеЗаписи.Ссылка.СерийныеНомера Цикл

			Если СтрДлина(Стр_1.cis)>18 Тогда
				
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СозданиеНовогоШкНаКороба_ХамелеонЦРПТМарки.Ссылка.НомерКороба КАК НомерКороба
		|ИЗ
		|	Документ.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.Марки КАК СозданиеНовогоШкНаКороба_ХамелеонЦРПТМарки
		|ГДЕ
		|	ПОДСТРОКА(СозданиеНовогоШкНаКороба_ХамелеонЦРПТМарки.cis, 1, 1000) = &cis
		|	И СозданиеНовогоШкНаКороба_ХамелеонЦРПТМарки.Ссылка.Статус = &Статус
		|	И СозданиеНовогоШкНаКороба_ХамелеонЦРПТМарки.Ссылка.ТипДокумента = &ТипДокумента";
	
	Запрос.УстановитьПараметр("cis", Стр_1.cis);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Обработан);
	Запрос.УстановитьПараметр("ТипДокумента", Перечисления.ВидДокументаУпаковок_ХамелеонЦРПТ.Формирование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ВыборкаДетальныеЗаписи_2 = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи_2.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		ССылк=ВыборкаДетальныеЗаписи.Ссылка;
		СтруктураПоиска=Новый Структура("НомерДекларацииТовара,ДатаДекларацииТовара,ТипДокумента,ДатаПроизводства");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,ССылк);
		Нстр=ТаблицаЗн.НайтиСтроки(СтруктураПоиска);
		Если Нстр.Количество()>0 Тогда
			ВводВ=Нстр[0].ВводВОборот;
		Иначе
			ВводВ=Документы.ВводВОборот_ХамелеонЦРПТ.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(ВводВ,Ссылк,,"Дата,Номер,Статус,ОшибкаОтправки,_Order_ID");
			ВводВ.Дата=ТекущаяДата();
			ВводВ.Комментарий="Созданы по агрегациям";
			
			НСтр=ТаблицаЗн.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр,ВВодВ);
			НСтр.ВводВОборот=ВводВ;
		КонецЕслИ;
		
		Если ВводВ.СерийныеНомера.Найти(ВыборкаДетальныеЗаписи_2.НомерКороба,"cis")=Неопределено Тогда
			
			Добав=ВводВ.СерийныеНомера.Добавить();
			ЗаполнитьЗначенияСвойств(Добав,Стр_1,,"НомерКороба,НомерСтрокиСвязи");
			Добав.cis=ВыборкаДетальныеЗаписи_2.НомерКороба;
			
			НстрокаТовара=Ссылк.Товары.Найти(Стр_1.НомерСтрокиСвязи,"НомерСтрокиСвязи");
			Структ=Новый Структура("GTIN,КодТНВЭД,ДекларацияИлиСертификатСоответствия");
			Если         НстрокаТовара<>Неопределено Тогда
				
				ЗаполнитьЗначенияСвойств(Структ,НстрокаТовара);
				
				СтрокуВВ=ВводВ.Товары.НайтиСтроки(Структ);
				Если    СтрокуВВ.Количество()=0 Тогда
					Добав_СтрТ=ВводВ.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(Добав_СтрТ,Структ);
					Добав_СтрТ.КоличествоКМ=1;
					Добав_СтрТ.НомерСтрокиСвязи=Добав_СтрТ.НомерСтроки;
					Добав.НомерСтрокиСвязи=					Добав_СтрТ.НомерСтрокиСвязи;
					
				Иначе
					СтрокуВВ[0].КоличествоКМ=СтрокуВВ[0].КоличествоКМ+1;
					Добав.НомерСтрокиСвязи=СтрокуВВ[0].НомерСтрокиСвязи;
					
				КонецЕсли;
				
			Иначе
				Добав_Т=ВводВ.Товары.Добавить();
				Добав_Т.НомерСтрокиСвязи=Добав_Т.НомерСтроки;
				Добав.НомерСтрокиСвязи=Добав_Т.НомерСтрокиСвязи;
				
				
			КонецЕсли;
			
			
		КонецЕсли;
		
		Прервать
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				
			КонецЕслИ;
				
			
		Конеццикла;
		
		
	КонецЦикла;
	

	Для Каждого Стр_1 из ТаблицаЗн Цикл
		       Стр_1.ВводВОборот.Записать();
			   СообщитЬ(Стр_1.ВводВОборот.Ссылка);
			//   Возврат;
	Конеццикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
